<?php

namespace unapi\def\common\vocabulary;

class MncVocabulary
{
    public function getMncNames()
    {
        return [
            25001 => ['МТС'],
            25002 => ['МегаФон'],
            25003 => ['Ростелеком'],
            25005 => ['ЕТК'],
            25006 => ['SkyLink', 'Danycom'],
            25007 => ['Смартс'],
            25011 => ['Yota'],
            25012 => ['АКОС', 'Дальсвязь'],
            25016 => ['НТК'],
            25018 => ['Основа Телеком'],
            25020 => ['Tele2'],
            25023 => ['ЗАО «Джи Ти Эн Ти»'],
            25027 => ['Летай'],
            25030 => ['ЗАО «Остелеком»'],
            25032 => ['WIN-Mobile', 'К-Телеком'],
            25033 => ['СевМобайл'],
            25034 => ['Крымтелеком'],
            25035 => ['МОТИВ'],
            25037 => ['СкайЛинк', 'Кодотел'],
            25039 => ['Ростелеком', 'Вайнахтелеком'],
            25042 => ['ОАО «Межрегиональный ТранзитТелеком»'],
            25043 => ['Спринт'],
            25050 => ['Сбербанк-Телеком'],
            25054 => ['ПАО «Таттелеком»'],
            25059 => ['NETBYNET'],
            25060 => ['Волна мобайл'],
            25061 => ['Интертелеком'],
            25092 => ['ПримТелефон'],
            25099 => ['Билайн'],

            43701 => ['Билайн'],
            43703 => ['Fonex'],
            43705 => ['MegaCom'],
            43709 => ['O!'],
        ];
    }
}
